Ran Plan for 2 projects:

1. dir: `.` workspace: `stage`
1. dir: `.` workspace: `prod`
---

### 1. dir: `.` workspace: `stage`
<details><summary>Show Output</summary>

```diff
Run plan on stage


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_vpc_subnet.subnet-b will be created
+ resource "yandex_vpc_subnet" "subnet-b" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-b-stage"
      + network_id     = "enp4oislmorsk4e6vaq7"
      + v4_cidr_blocks = [
          + "192.168.5.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -w stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://3d9cb963b262:4141/lock?id=owirtifo%252Fapp-atlantis-test%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -w stage
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `prod`
<details><summary>Show Output</summary>

```diff
Run plan on prod

data.terraform_remote_state.default: Reading...
data.terraform_remote_state.default: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_vpc_network.netology-vpc will be created
+ resource "yandex_vpc_network" "netology-vpc" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = "b1gge1m2ng2nlr4df7bo"
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "netology-vpc-prod"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet-a will be created
+ resource "yandex_vpc_subnet" "subnet-a" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-a-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.1.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet-b will be created
+ resource "yandex_vpc_subnet" "subnet-b" {
      + created_at     = (known after apply)
      + folder_id      = "b1gge1m2ng2nlr4df7bo"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-b-prod"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.2.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -w prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://3d9cb963b262:4141/lock?id=owirtifo%252Fapp-atlantis-test%252F.%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -w prod
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```